Revit 2026 API

# ElevationFailures Properties

---

The BuiltInFailuresElevationFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ElevationDetach | An Elevation arrow can't keep its Crop Region extents attached. |
|  | IncompatibleElevationTagFamily | Attempt to change elevation tag families to one with incompatible view directions. |
|  | WarnElevSheet | An elevation symbol references views on more than one sheet. It will show a blank sheet reference. To show the correct references, use a separate elevation symbol for the views on each sheet. |

#### Reference

BuiltInFailuresElevationFailures Class

Autodesk.Revit.DB Namespace